<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Working With Time Series Data

---

In [1]:
from datetime import datetime

import pandas as pd

In [17]:
ufo = pd.read_csv('http://bit.ly/uforeports')

## Create a `datetime` object representing today's date.

In [7]:
# Time this lesson plan was written:
lesson_date = datetime(2018, 5, 14, 20, 7)
print (type(lesson_date))
print (lesson_date.month)

<class 'datetime.datetime'>
5

## Convert the `Time` column of `ufo` to a `datetime` object.

In [18]:
ufo.loc[:, 'Time'].apply(type) # panda will tell you its string, its string representing time
# lets change that

ufo.loc[:, 'Time'] = pd.to_datetime(ufo.loc[:, 'Time'])
ufo.loc[:, 'Time'].apply(lambda ts: ts.month)

0         6
1         6
2         2
3         6
4         4
5         9
6         6
7         7
8        10
9         6
10        8
11        6
12        6
13        7
14        6
15        7
16        2
17        6
18        7
19        4
20        6
21        8
22        8
23       10
24        1
25        1
26        1
27        4
28        6
29        6
         ..
18211    12
18212    12
18213    12
18214    12
18215    12
18216    12
18217    12
18218    12
18219    12
18220    12
18221    12
18222    12
18223    12
18224    12
18225    12
18226    12
18227    12
18228    12
18229    12
18230    12
18231    12
18232    12
18233    12
18234    12
18235    12
18236    12
18237    12
18238    12
18239    12
18240    12
Name: Time, Length: 18241, dtype: int64

In [16]:
# Check the data types
ufo.head()

                                     City Colors Reported Shape Reported State
Time
1930-06-01 22:00:00                Ithaca             NaN       TRIANGLE    NY
1930-06-30 20:00:00           Willingboro             NaN          OTHER    NJ
1931-02-15 14:00:00               Holyoke             NaN           OVAL    CO
1931-06-01 13:00:00               Abilene             NaN           DISK    KS
1933-04-18 19:00:00  New York Worlds Fair             NaN          LIGHT    NY

## Set the `Time` column to the index of the DataFrame.

In [19]:
ufo.set_index('Time', inplace=True) # to change in the same data frame ufo

In [21]:
ufo.head()

                                     City Colors Reported Shape Reported State
Time
1930-06-01 22:00:00                Ithaca             NaN       TRIANGLE    NY
1930-06-30 20:00:00           Willingboro             NaN          OTHER    NJ
1931-02-15 14:00:00               Holyoke             NaN           OVAL    CO
1931-06-01 13:00:00               Abilene             NaN           DISK    KS
1933-04-18 19:00:00  New York Worlds Fair             NaN          LIGHT    NY

## Create a Pandas `timestamp` object for the date January 1, 1999.

In [23]:
ts = pd.to_datetime('1/1/1999')
ts

Timestamp('1999-01-01 00:00:00')

## Use the `timestamp` object to perform logical filtering on the DataFrame and create a subset of entries with a date above or equal to January 1, 1999.

In [24]:
recent_ufos = ufo.loc[ufo.index >=ts, :]
recent_ufos.head()

                                  City Colors Reported Shape Reported State
Time
1999-01-01 02:30:00          Loma Rica             NaN          LIGHT    CA
1999-01-01 03:00:00            Bauxite             NaN            NaN    AR
1999-01-01 14:00:00           Florence             NaN       CYLINDER    SC
1999-01-01 15:00:00       Lake Henshaw             NaN          CIGAR    CA
1999-01-01 17:15:00  Wilmington Island             NaN          LIGHT    GA